{
  "TitleSection": {
    "title": "Maakaf Community"
  },
  "Metadata": {
    "HomePage": {
      "title": "Home page | Maakaf",
      "description": "Maakaf is a community of open source developers"
    }
  },
  "about": {
    "welcome": "Welcome to Maakaf",
    "firstParagraph": "We believe in sharing information and knowledge as a way to promote technology and innovation. Open source is an approach that allows us to collaborate in software development openly and transparently.",
    "secondParagraph": "When we talk about open source, we refer to software whose source code is available to the public for viewing, modification, and improvement. Open source gives us the opportunity to understand how software works, to enhance it, and to tailor it to our needs. We invite you to join us, to be impressed, to share, and to influence. Here in the Israeli open source community, there is a place for everyone, from beginners to experts.",
    "thirdParagraph": "Join us"
  },
  "terms-of-use": {
    "title": "Terms of Use",
    "firstParagraph": "Welcome to Maakaf! We're thrilled to have you join our community of developers and programmers dedicated to contributing code to a diverse range of projects. Before you dive in, please take a moment to review the following terms of use. By accessing or using our website, you agree to abide by these terms and conditions.",
    "secondParagraph": "1. Acceptance of Terms: By accessing or using our website, you agree to be bound by these Terms of Use and all applicable laws and regulations. If you do not agree with any of these terms, you are prohibited from using or accessing this site.\n2. Code of Conduct: We foster an inclusive and respectful community where all members are treated with dignity and respect. Please review and adhere to our Code of Conduct at all times.\n3. Contributions: By submitting code or any other content to our website, you grant us a perpetual, irrevocable, worldwide, non-exclusive, royalty-free, sublicensable license to use, modify, adapt, publish, translate, distribute, and display such content in any form, media, or technology now known or later developed.\n4. Intellectual Property: All code and content shared on our website are subject to the applicable intellectual property rights. You retain ownership of the code you contribute but grant other users the right to use, modify, and distribute your code in accordance with the open-source licenses applicable to the respective projects.\n5. User Responsibilities: You are responsible for the content you contribute to our website and any consequences thereof. Please ensure that your contributions comply with our Contributor Guidelines and do not infringe upon the rights of others.\n6. Privacy Policy: We respect your privacy and are committed to protecting your personal information. Our Privacy Policy outlines how we collect, use, and disclose your information when you use our website.\n7. Disclaimer of Warranties: Our website is provided on an \"as-is\" and \"as-available\" basis without any warranties, express or implied. We do not guarantee the accuracy, completeness, or reliability of any content posted on our website.\n8. Limitation of Liability: In no event shall we be liable for any direct, indirect, incidental, special, or consequential damages arising out of or in any way connected with your use of our website or the content posted therein.\n9. Modification of Terms: We reserve the right to modify or revise these Terms of Use at any time without prior notice. Your continued use of our website after any such changes constitutes your acceptance of the new terms.\n10. Governing Law: These Terms of Use shall be governed by and construed in accordance with the laws of the Israeli Judicial Authority, without regard to its conflict of law provisions.",
    "thirdParagraph": "If you have any questions or concerns about these terms, please contact us at Discord --> [https://discord.com/invite/a2VyCjRk2M].\nThank you for being a part of Maakaf! "
  }
}
